app/views/quotes/_form.html.erb

          <%= qf.label :category_id, "Category" %>
          <%= qf.select :category_id,
                Category.all.collect { |c| [c.name, c.id] },
                { include_blank: "Select a category" },
                class: "form-control d-inline-block" %>
---
SELECT "categories".* FROM "categories"