app/views/quotes/show.html.erb

    <h5>Author Information</h5>
    <% if @quote.author.present? %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 9 LIMIT 1

    <h5>Categories</h5>
    <% if @quote.categories.any? %>
      <ul>
        <% @quote.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 11
SELECT 1 AS one FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 25 LIMIT 1
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 25

    <h5>Added By</h5>
    <% if @quote.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 16 LIMIT 1