app/views/search/index.html.erb


        <% if quote.author.present? %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 9 LIMIT 1