app/views/home/index.html.erb

SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (12, 11, 10, 9, 8, 7, 6, 3, 1)
---
      <footer class="blockquote-footer">
        <% if quote.author.present? %>