app/controllers/home_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (12, 11, 10, 9, 8, 7, 6, 3, 1)
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (4, 10, 13, 5, 9, 12, 7, 3)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC LIMIT 10
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 4, 5)
---
    def index
        @quotes = Quote.where(is_public: true)
                   .order(created_at: :desc)
                   .limit(10)
                   .includes(:author, :user, :categories)

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (9, 12)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = 2
---
    def uquotes
        @quotes = Quote.includes(:categories).where(user_id: session[:user_id])