app/controllers/quotes_controller.rb

  def create
    @quote = current_user.quotes.new(quote_params)

    respond_to do |format|
      if @quote.save
        format.html { redirect_to @quote, notice: "Quote was successfully created." }
        format.json { render :show, status: :created, location: @quote }
      else
        # Rebuild the form if validation fails
        @quote.build_author unless @quote.author
        (15 - @quote.quote_categories.size).times { @quote.quote_categories.build }
---
INSERT INTO "quotes" ("text", "publication_year", "is_public", "user_comment", "user_id", "author_id", "created_at", "updated_at") VALUES ('Be good ', NULL, 1, '', 16, NULL, '2025-10-08 10:01:15.313832', '2025-10-08 10:01:15.313832') RETURNING "id"
SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 19 AND "quote_categories"."id" IN (31, 32)

  def update
    respond_to do |format|
      if @quote.update(quote_params)
---
UPDATE "quotes" SET "is_public" = 0, "updated_at" = '2025-10-10 06:06:09.537170' WHERE "quotes"."id" = 33

  def destroy
    @quote.destroy!
---
DELETE FROM "quotes" WHERE "quotes"."id" = 22

    def set_quote
      @quote = Quote.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 22 LIMIT 1