app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    #@users = User.all
    # if there is a logged in user and that user is the administrator
    if logged_in? && is_administrator?
      @users = User.all # then retrieve all users from the database

INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES ('Andrew', 'Lukashchuk', 'a@gmail.com', '$2a$12$AIaN0oC7MAQIknfwscaVHuO38hhuGmKUhTPZjxuc3THKWw5XgAm6K', 0, 'Active', '2025-10-08 08:22:09.907104', '2025-10-08 08:22:09.907104') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = '$2a$12$MQ1nGMJyTRCHADUxxrfSXu8Ek8ufmOEbP5hfiZcPttrVKp6WTrvsC', "updated_at" = '2025-10-08 08:22:27.950109' WHERE "users"."id" = 16
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = 17
---
  def destroy
    @user.destroy!

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
    def set_user
      @user = User.find(params.expect(:id))